<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Microsoft's Intune Company Portal installer package, renames the package to match our naming standard, then uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.rickgmac.jssupload.MicrosoftIntuneCompanyPortal</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Intune Company Portal</string>
            <key>CATEGORY</key>
            <string>Microsoft</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.MicrosoftIntuneCompanyPortal</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>