<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest unlicensed Microsoft Outlook for Office 365 installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.rickgmac.jssupload.microsoftoutlook365</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Outlook</string>
            <key>CATEGORY</key>
            <string>Microsoft</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.microsoftoutlook365</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
