<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of NoMAD and extracts the installer package. Recipe provided by Rich Trouton.</string>
	<key>Identifier</key>
	<string>com.github.rickgmac.pkg.NoMADLogin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NoMAD-Login-AD</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rickgmac.download.NoMADLogin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
	</array>
</dict>
</plist>
